app/views/posts/index.html.erb

<% if !params[:author].blank? %>
  <% @posts = Post.where(author: params[:author]) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8